app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    @products = Product.all

INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "created_at") VALUES('img/gold.jpg', '2009-10-17 20:21:40', 'Gold', 1056.0, 'The next best thing in the world.', '2009-10-17 20:21:40')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 1)
UPDATE "products" SET "image_url" = 'img/dollar.jpg', "description" = 'A soon to be useless commodity. Thanks to Barack Obama and Ben Bernanke.', "updated_at" = '2009-10-17 18:38:09' WHERE "id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])